Tekla.Structures.DirectManipulation.Adapter.EventRegistry
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry class receives and exposes events raised by the connected Tekla Structures.
Remarks:
Be careful when changing any string values here, they must at all times match with the values defined on TS core side.
For examples look in mdl_actions.ail for "OnDMSelectionChanged", "OnDMInterrupt", ...

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.Registry
The registry of identifiers and their associated handlers.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.EventRegistry class.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.OnEvent(System.String)
Called by Tekla Structures when an event is raised.
Should not be called from the Direct Manipulation side.
param: The name of the event.
Returns: Always the integer 1.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.OnCommand(System.String)
Called by Tekla Structures when a command is started.
param: The name of the command.
Returns: Always the integer 1.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.RegisterHandler(System.String,System.Action{System.String})
Associates a handler delegate to the eventDescriptor.
Remarks:
When Tekla Structures raises an event with the given eventDescriptor,
the associated handler is invoked with eventDescriptor as parameter.
eventDescriptor: The descriptor to associate the handler to. Preferably use the constants defined in Tekla.Structures.DirectManipulation.Adapter.EventRegistry.
handler: The handler to invoke when an event with the given descriptor is received.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.UnregisterHandler(System.String,System.Action{System.String})
Undoes the association between the handler and the descriptor.
eventDescriptor: The descriptor the handler is associated to.
handler: The handler to unregister.